cask_args appdir: "/Applications"

# Source control
brew "git"
brew "git-delta"
brew "svn"

# Terminal & Editors
brew "antigen"
brew "bash"
brew "neovim"
brew "zsh"
brew "starship"

# Utilities
brew "coreutils"
brew "defaultbrowser"
brew "fzf"
brew "gron"
brew "htop"
brew "icdiff"
brew "jq"
brew "nmap"
brew "tree"
brew "watch"
brew "wget"
brew "yq"

# Kubernetes & Containers
brew "helm"
brew "kind"
brew "kubebuilder"
brew "kubernetes-cli"
brew "kustomize"
brew "podman"

# Language Toolchains
brew "go"
brew "gopls"
brew "lua-language-server"
brew "rust-analyzer"
brew "rustup"

# Security
brew "gnupg"
brew "pinentry-mac"
brew "ykman"

# Applications
cask "1password"
cask "alacritty"
cask "firefox"
cask "goland"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "notion"
cask "slack"
cask "zoom"

# Fonts
tap "homebrew/cask-fonts"
cask "font-source-code-pro"
cask "font-sauce-code-pro-nerd-font"

