cask_args appdir: "/Applications"

tap "homebrew/cask"

brew "git"
brew "htop"
brew "jq"
brew "nmap"
brew "tree"
brew "watch"
brew "wget"
brew "yq"
cask "google-cloud-sdk"
cask "firefox"
cask "go"
brew "kubernetes-cli"
brew "kubebuilder"
brew "kind"
brew "kustomize"
brew "pinentry-mac"
brew "gnupg"
cask "gpg-suite"
cask "iterm2"
cask "zoom"
cask "notion"
cask "slack"
cask "google-chrome"
cask "podman"
brew "gron"
brew "neovim"
cask "goland"
cask "alacritty"
cask "1password"
cask "microsoft-teams"

tap "homebrew/cask-fonts"
cask "font-source-code-pro"

